<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"b751580052f69330cf73e7e09fb7d48e283dac74c0ef17c89b41ea0a74734ab7","plan_job_ref":"Job Infrastructure Continuous Deployment #13 at https://github.com/sethltaylor/Bird-Sighting-Tracker/actions/runs/7597023793","plan_out_hash":"88542008caa22cd043a42a9454e0c6d0cd5e0c554f9d99506927d284a497b371","plan_hash":"91fc63e865d5bb08736333c31c263c70946addc4d4619d7cca13ec75bbb6bd21","plan_text_format":"diff","version":"1.41.1","closed":true} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 4 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_appautoscaling_policy.recent_observation_table_policy will be created
+   resource "aws_appautoscaling_policy" "recent_observation_table_policy" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "DynamoDBWriteCapacityUtilization:table/RecentObservations"
+       policy_type        = "TargetTrackingScaling"
+       resource_id        = "************************"
+       scalable_dimension = "dynamodb:table:WriteCapacityUnits"
+       service_namespace  = "dynamodb"

+       target_tracking_scaling_policy_configuration {
+           disable_scale_in = false
+           target_value     = 70

+           predefined_metric_specification {
+               predefined_metric_type = "DynamoDBWriteCapacityUtilization"
            }
        }
    }

  # aws_appautoscaling_policy.recent_observation_table_read_policy will be created
+   resource "aws_appautoscaling_policy" "recent_observation_table_read_policy" {
+       alarm_arns         = (known after apply)
+       arn                = (known after apply)
+       id                 = (known after apply)
+       name               = "DynamoDBReadCapacityUtilization:table/RecentObservations"
+       policy_type        = "TargetTrackingScaling"
+       resource_id        = "************************"
+       scalable_dimension = "dynamodb:table:ReadCapacityUnits"
+       service_namespace  = "dynamodb"

+       target_tracking_scaling_policy_configuration {
+           disable_scale_in = false
+           target_value     = 70

+           predefined_metric_specification {
+               predefined_metric_type = "DynamoDBReadCapacityUtilization"
            }
        }
    }

  # aws_appautoscaling_target.recent_observation_table_read_target will be created
+   resource "aws_appautoscaling_target" "recent_observation_table_read_target" {
+       arn                = (known after apply)
+       id                 = (known after apply)
+       max_capacity       = 25
+       min_capacity       = 1
+       resource_id        = "************************"
+       role_arn           = (known after apply)
+       scalable_dimension = "dynamodb:table:ReadCapacityUnits"
+       service_namespace  = "dynamodb"
+       tags_all           = (known after apply)
    }

  # aws_appautoscaling_target.recent_observation_table_write_target will be created
+   resource "aws_appautoscaling_target" "recent_observation_table_write_target" {
+       arn                = (known after apply)
+       id                 = (known after apply)
+       max_capacity       = 25
+       min_capacity       = 1
+       resource_id        = "************************"
+       role_arn           = (known after apply)
+       scalable_dimension = "dynamodb:table:WriteCapacityUnits"
+       service_namespace  = "dynamodb"
+       tags_all           = (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

:white_check_mark: Plan applied in [Infrastructure Continuous Deployment #13](https://github.com/sethltaylor/Bird-Sighting-Tracker/actions/runs/7597023793)
<details open><summary>Outputs</summary>

```hcl
recent_observation_table_arn   = "arn:aws:dynamodb:us-east-1:851725613770:table/RecentObservations"
recent_observations_table_name = "RecentObservations"
```
</details>